trade_exp/src/Documents/ПроверкаЦенников/ПроверкаЦенников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fd17951c-1da2-49db-9c7e-f3150fc241fe">
  <name>ПроверкаЦенников</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="4a70e6fe-639f-44de-b3fd-237230052dc1">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5034a4d7-93d7-48ba-a44d-fdf429bc2eac">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f7b9df7f-e2d1-4043-b06e-85fd4416f45a">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c849c33d-d44b-4398-9231-c9df953c93e2">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f9936d4d-9ec9-462a-8a56-f4dc8a27e883">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="59518efd-1ffc-47bb-919d-987145052d36">
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="33f586b2-0658-4db5-a72d-9f3fb3f64b70">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5d65bbef-e89d-4630-ad15-da4215e03885">
    <name>ОтборПроверки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2c0981d1-37a3-4097-943b-888d82353308">
    <name>ДополнительноеСведениеКолонки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e6412a95-3905-47a5-b58c-42ddc3273893">
    <name>ВидПроверки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="6ed79a42-e86c-4a2e-bcdd-4741381451bd">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="85673eb7-8a97-4e43-8918-bc1fd724a199">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="00cebe0f-6fe8-498f-9da3-00097fb7b1ff">
      <name>ЦенаТекущая</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="43b8f031-f17d-450b-8d5d-9331b98c3e40">
      <name>ЦенаНаЦеннике</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="bee02909-0b00-49d6-8e3a-17bdc46db3f3">
      <name>ЕстьРасхождения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b14de1c9-ce62-446e-b7f4-1e380660b377">
      <name>Штрихкод</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>200</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="307a9612-2229-444e-9ab6-16cbcdd055e0">
      <name>НетЦенника</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="12fd7174-1d80-46c0-8a1c-1bef2134ec91">
      <name>ДополнительноеСведение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c7bc165d-b056-49f4-9989-2b83551a416e">
      <name>Проверено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/InformationRegisters/ПроверкаЦенников/ПроверкаЦенников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fe415972-e3f8-4f24-9121-8b7bd28f803d">
  <name>ПроверкаЦенников</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="1e506e86-174d-4feb-ace1-18ed47c84401">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="09045eb3-7a4b-41ec-a9ec-a7fa6426c086">
    <name>Сотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="9324264a-018d-4ca8-b8dc-a050686c66b9">
    <name>Проверено</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="286cc05e-d939-448b-a8fc-20d04de6d6e4">
    <name>Просчитано</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="578bd0ba-b0de-432f-a6fc-b1f60a16199a">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="310bb204-549c-4710-859b-280ff8b6a59d">
    <name>Документ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="76a0a643-f24f-4fef-b619-83ef08b7a4a4">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Documents/ПроверкаЦенников/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
&Вместо("ОбработкаЗаполнения")
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		ДанныеЗаполнения.Свойство("Организация",Организация);
		ДанныеЗаполнения.Свойство("Подразделение",Подразделение);
		ДанныеЗаполнения.Свойство("Склад",Склад);
		ДанныеЗаполнения.Свойство("Автор",Автор);
		
		ВидЦены = АльтерраОбщегоНазначения.ЗначениеРеквизитаОбъекта(Подразделение, "ЦенаПоКарте");
		
	КонецЕсли;

	Ответственный= Пользователи.ТекущийПользователь();
	
КонецПроцедуры

&После("ОбработкаПроведения")
Процедура Док_ОбработкаПроведения(Отказ, РежимПроведения)
	РегистрыСведений.ПроверкаЦенников.ЗаписьВРегистре(Ссылка); 
КонецПроцедуры


#КонецЕсли
